L01-V01-Vectores.org
#+TITLE: Lección 1 del curso - Vídeo 1
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es-es
# +STARTUP: show3levels

#+LaTeX_HEADER: \usepackage{nacal}
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LaTeX_HEADER: \usepackage{pdfpages}

# Para que no ejecute todo el código al exportar a pdfL01_V02_E02_PropiedadConmutativa
#+PROPERTY: header-args :eval never-export

\maketitle

*** COMMENT Ajustes para la compilación de la documentación
#+CALL: NombreEnChunksDeCodigo()
#+NAME: NombreEnChunksDeCodigo
#+BEGIN_SRC emacs-lisp :results silent
(setq org-babel-exp-code-template
         (concat "\n#+ATTR_LATEX: :options label=%name\n"
              org-babel-exp-code-template)
               )
#+END_SRC


* Vectores de \R[n] - V01


** Escena 1 - Definición de vector de \R[n]

#+call: rodando(fichero="L01_V01_Vectores", escena="1")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E01_VectoresDefinicion.mp4

#+name: L01_V01_E01_VectoresDefinicion
#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V01_Vectores.py
<<Carga de la librería Manim y NacAL con AzureService>>

<<copyright>>

class L01_V01_E01_VectoresDefinicion(VoiceoverScene):
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )
      
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"\usepackage{nacal}")

        # Copyright lateral
        <<copyrightLateral>>
        
        # Portada
        titulo = Title(r"Definición de vector de \R[n] y notación",
                     tex_template = myTemplate,
                     font_size=70).set_color(BLUE)
        self.play(Write(titulo))
        self.wait(1.5)
        self.play(FadeOut(titulo))
	
        # Definición de vector
        definicion = Tex("Un vector de ",
                         r"$\R[n]$",
                         r" es una \emph{lista ordenada} de $n$ números",
                         tex_template = myTemplate,
                         ).to_edge(UP).set_width(13)
        with self.voiceover(text=r"Un vector de R n es una lista ordenada de números. ") as tracker:
            self.add(definicion)
	
        # Aclaración de la notación
        with self.voiceover(text="La R indica que los números son reales.") as tracker:
            self.play(Circumscribe(definicion[1][0], fade_out=True), run_time=tracker.duration)
            
        with self.voiceover(text="""Y el superíndice n indica que la lista contiene n
        números.""") as tracker:
            self.play(Circumscribe(definicion[1][1], fade_out=True), run_time=tracker.duration)
            self.wait(0.3)
            
        with self.voiceover(text="""que la lista sea ordenada significa que importa el orden en el
        que aparecen sus elementos.""") as tracker:
            self.play(Circumscribe(definicion[2][5:18], fade_out=True), run_time=tracker.duration)
	
        # Ejemplos
        Ej = Tex(r"\textbf{Ejemplos:}",
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(definicion, DOWN, aligned_edge=LEFT)
        self.add(Ej)
	
        d = nc.Vector([1,2,3],'h')
        Ej1 = MathTex( d.latex(), "\\ne", nc.Vector(reversed(d),'h').latex() ) 
        with self.voiceover(text="""Por ejemplo, los vectores, uno dos tres y tres dos uno, son
        distintos.""") as tracker:
            self.play(FadeIn(Ej1))
            self.wait(tracker.duration-0.5)
            self.play(FadeOut(Ej1))
	
        p = nc.Vector([sp.pi,sp.pi,sp.pi,sp.pi],'h')
        Ej2 = MathTex(p.latex(), r"\ne", nc.Vector(p|(1,2),'h').latex() )
        with self.voiceover(text=r"""También son distintos los vectores con distinta cantidad de
        elementos. Por ejemplo, el vector de la izquierda pertenece a R 4 por ser una lista de
        4 números. El de la derecha pertenece a R
        2.""") as tracker:
            self.add(Ej2)
            self.wait(tracker.duration-0.5)
            self.play(FadeOut(Ej2))
	
        c = nc.Vector([sp.pi,nc.fracc(3,4),0,0.11],'h')
        Ej3 = MathTex(c.latex(),"=",c.latex())
        with self.voiceover(text=r"""En consecuencia, dos vectores serán iguales si, y solo si, sus
        correspondientes listas son idénticas""") as tracker:
            self.play(FadeIn(Ej3))
            self.wait(tracker.duration)
            self.play(FadeOut(Ej3))            
        self.play(FadeOut(Ej))
        self.wait()
        
#+END_SRC


#+call: rodando(fichero="L01_V01_Vectores", escena="1")
#+call: rodandoHD(fichero="L01_V01_Vectores", escena="1")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E01_VectoresDefinicion.mp4


