L01-V01-Vectores.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es-es" xml:lang="es-es">
<head>
<!-- 2024-12-23 lun 15:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lección 1 del curso - Vídeo 1</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lección 1 del curso - Vídeo 1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0b4e111">1. Vectores de \R[n] - V01</a>
<ul>
<li><a href="#org05409ba">1.1. Escena 1 - Definición de vector de \R[n]</a></li>
<li><a href="#org24b2fc0">1.2. Escena 2 - Notación vectores de \R[n]</a></li>
<li><a href="#org7cd3e79">1.3. Escena 3 - Selección de elementos de un vector de \R[n]</a></li>
</ul>
</li>
<li><a href="#orgca16ea7">2. Trozos comunes de código</a>
<ul>
<li><a href="#org6777b50">2.1. Carga de la librería Manim y NacAL</a></li>
<li><a href="#orgcdedccf">2.2. Creditos</a></li>
</ul>
</li>
<li><a href="#org3a9ce80">3. Rodando: 1,2,3&hellip; ¡acción!</a></li>
</ul>
</div>
</div>
<p>
\maketitle
</p>
<div id="outline-container-org0b4e111" class="outline-2">
<h2 id="org0b4e111"><span class="section-number-2">1.</span> Vectores de \R[n] - V01</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org05409ba" class="outline-3">
<h3 id="org05409ba"><span class="section-number-3">1.1.</span> Escena 1 - Definición de vector de \R[n]</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python" id="org7702387">&lt;&lt;Carga de la librer&#237;a Manim y NacAL con AzureService&gt;&gt;

&lt;&lt;<span style="color: #D0372D;">copyright</span>&gt;&gt;

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V01_E01_VectoresDefinicion</span>(VoiceoverScene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )
      
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"\usepackage{nacal}"</span>)

        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copyright lateral</span>
        &lt;&lt;copyrightLateral&gt;&gt;
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Portada</span>
        <span style="color: #BA36A5;">titulo</span> = Title(r<span style="color: #008000;">"Definici&#243;n de vector de \R[n] y notaci&#243;n"</span>,
                     tex_template = myTemplate,
                     font_size=70).set_color(BLUE)
        <span style="color: #0000FF;">self</span>.play(Write(titulo))
        <span style="color: #0000FF;">self</span>.wait(1.5)
        <span style="color: #0000FF;">self</span>.play(FadeOut(titulo))
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Definici&#243;n de vector</span>
        <span style="color: #BA36A5;">definicion</span> = Tex(<span style="color: #008000;">"Un vector de "</span>,
                         r<span style="color: #008000;">"$\R[n]$"</span>,
                         r<span style="color: #008000;">" es una \emph{lista ordenada} de $n$ n&#250;meros"</span>,
                         tex_template = myTemplate,
                         ).to_edge(UP).set_width(13)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"Un vector de R n es una lista ordenada de n&#250;meros. "</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(definicion)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Aclaraci&#243;n de la notaci&#243;n</span>
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"La R indica que los n&#250;meros son reales."</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Circumscribe(definicion[1][0], fade_out=<span style="color: #D0372D;">True</span>), run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"Y el super&#237;ndice n indica que la lista contiene n</span>
<span style="color: #008000;">        n&#250;meros."</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Circumscribe(definicion[1][1], fade_out=<span style="color: #D0372D;">True</span>), run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.wait(0.3)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""que la lista sea ordenada</span>
<span style="color: #008000;">        significa que importa el orden en el que aparecen sus</span>
<span style="color: #008000;">        elementos."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Circumscribe(definicion[2][5:18], fade_out=<span style="color: #D0372D;">True</span>), run_time=tracker.duration)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ejemplos</span>
        <span style="color: #BA36A5;">Ej</span> = Tex(r<span style="color: #008000;">"\textbf{Ejemplos:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(definicion, DOWN, aligned_edge=LEFT)
        <span style="color: #0000FF;">self</span>.add(Ej)
        
        <span style="color: #BA36A5;">d</span> = nc.Vector([1,2,3],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">Ej1</span> = MathTex( d.latex(), <span style="color: #008000;">"</span><span style="color: #D0372D;">\\</span><span style="color: #008000;">ne"</span>, nc.Vector(<span style="color: #006FE0;">reversed</span>(d),<span style="color: #008000;">'h'</span>).latex() ) 
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"Por ejemplo, los vectores, uno dos tres y tres dos uno, son</span>
<span style="color: #008000;">        distintos."</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(Ej1))
            <span style="color: #0000FF;">self</span>.wait(tracker.duration-0.5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Ej1))
        
        <span style="color: #BA36A5;">p</span> = nc.Vector([sp.pi,sp.pi,sp.pi,sp.pi],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">Ej2</span> = MathTex(p.latex(), r<span style="color: #008000;">"\ne"</span>, nc.Vector(p|(1,2),<span style="color: #008000;">'h'</span>).latex() )
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""Tambi&#233;n son distintos los vectores con distinta cantidad de</span>
<span style="color: #008000;">        elementos. Por ejemplo, el vector de la izquierda pertenece a R 4 por ser una lista de</span>
<span style="color: #008000;">        4 n&#250;meros. El de la derecha pertenece a R</span>
<span style="color: #008000;">        2."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(Ej2)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration-0.5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Ej2))
        
        <span style="color: #BA36A5;">c</span> = nc.Vector([sp.pi,nc.fracc(3,4),0,0.11],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">Ej3</span> = MathTex(c.latex(),<span style="color: #008000;">"="</span>,c.latex())
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""En consecuencia, dos vectores ser&#225;n iguales si, y solo si, sus</span>
<span style="color: #008000;">        correspondientes listas son id&#233;nticas"""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(Ej3))
            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Ej3))            
        <span style="color: #0000FF;">self</span>.play(FadeOut(Ej))
        <span style="color: #0000FF;">self</span>.wait()
        
</pre>
</div>
</div>
</div>
