L01-V01-Vectores.org
** Escena 2 - Notación vectores de \R[n]

#+call: rodando(fichero="L01_V01_Vectores", escena="2")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E02_VectoresNotacion.mp4

#+name: L01_V01_E02_VectoresNotacion
#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V01_Vectores.py
class L01_V01_E02_VectoresNotacion(VoiceoverScene):
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )
      
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"\usepackage{nacal}")
        
        # Copyright lateral
        <<copyrightLateral>>
        
        # Definición de vector
        definicion = Tex("Un vector de ",
                         r"$\R[n]$",
                         r" es una \emph{lista ordenada} de $n$ números",
                         tex_template = myTemplate,
                         ).to_edge(UP).set_width(13)
        self.add(definicion)
        d = nc.Vector([1,2,3],'h')
        p = nc.Vector([sp.pi,sp.pi,sp.pi,sp.pi],'h')
            
        # Notacion
        Notac = Tex(r"\textbf{Notación:}",
                 tex_template = myTemplate,
                 font_size=50).set_color(BLUE).next_to(definicion, DOWN, aligned_edge=LEFT)
        self.add(Notac)
        self.wait()

        a    = nc.Vector( [5, 1, 10] , 'h')        
        Not1 = MathTex(a.latex(),        tex_template = myTemplate,)
        Not2 = MathTex(r"=",             tex_template = myTemplate,)
        Not3 = MathTex(a.copy().latex(), tex_template = myTemplate,)
        grp1 = VGroup(Not1,Not2,Not3).arrange(RIGHT)
        with self.voiceover(text=r"""Para expresar un vector basta indicar la lista de elementos en su
        correspondiente orden.""") as tracker:
            self.add(grp1)
            self.play(Circumscribe(definicion[2][5:18]),run_time=tracker.duration)
            
        with self.voiceover(text=r"""Por este motivo podemos escribir un mismo vector tanto en
        horizontal como en vertical. Pero tenga en cuenta que la
        mayoría de manuales no respetan este convenio, y consideran,
        al contrario de lo que haremos nosotros, que vectores fila y
        vectores columna son objetos distintos.""") as tracker:
            self.wait(tracker.duration+0.3)
	
        with self.voiceover(text=r"""Siempre escribiremos la lista de números encerrada entre
        paréntesis; poniendo una coma detrás de cada elemento cuando
        escribamos el vector en horizontal.""") as tracker:
            self.play(Indicate(grp1[0][0][::len(grp1[0][0])-1]),
                      Indicate(grp1[2][0][0:2]), Indicate(grp1[2][0][-2:]),
                      run_time=tracker.duration/2)
            self.play(Flash(grp1[0][0][2]),
                      Flash(grp1[0][0][4]), Flash(grp1[0][0][7]),
                      run_time=tracker.duration/8)
            self.wait(tracker.duration/8)
            self.play(Circumscribe(grp1[0]))
            self.play(FadeOut(grp1))
	
        VectorNoNumero =  MathTex(r"(3)",
                                  r"\ne",(3*nc.V1(1)).latex(),
                                  r"\in\R[1]",
                                  tex_template = myTemplate,)
        with self.voiceover(text=r"""Así podremos distinguir un número entre paréntesis de un
        vector de R 1;""") as tracker:
            self.add(VectorNoNumero)
            self.play(Indicate(VectorNoNumero[0]),run_time=tracker.duration*2/3)
            self.play(Indicate(VectorNoNumero[2]),run_time=tracker.duration/3)
        with self.voiceover(text=r"""es decir, de una lista con un solo número.""") as tracker:
            self.play(Indicate(VectorNoNumero[3]),
                      Flash(definicion[2][-9]),
                      run_time=tracker.duration)
            self.play(FadeOut(VectorNoNumero))
            
        Vectores = MathTex(r"\Vect{a}, \Vect{b}, \Vect{c},\ldots\Vect{x}, \Vect{y}, \Vect{z}",
                           tex_template = myTemplate,).move_to( UP )
        Vector1  = MathTex(r"\Vect{a}=",a.copy().latex(),   tex_template = myTemplate,)
        Vector2  = MathTex(r"\Vect{d}=",d.copy().latex(),   tex_template = myTemplate,)
        Vector3  = MathTex(r"\Vect{x}=",p.copy().latex(),   tex_template = myTemplate,)
        grp3 = VGroup(Vector1,Vector2,Vector3).arrange(RIGHT, buff=2).next_to(Vectores, DOWN)
        with self.voiceover(text=r"""Para denotar vectores usaremos letras minúsculas en negrita
        cursiva.""") as tracker:
            self.add(Vectores)
            self.add(grp3)
            self.wait(tracker.duration/2)
            self.play(Indicate(Vectores),run_time=tracker.duration/2)
            self.play(FadeOut(Vectores))
            self.play(Indicate(Vector1[0][0],scale_factor=2.),
                      Indicate(Vector2[0][0],scale_factor=2.),
                      Indicate(Vector3[0][0],scale_factor=2.),
                      run_time=1.5)
            self.play(FadeOut(grp3))
            
        Vnulo = MathTex(r"\Vect{0}", tex_template = myTemplate,)#.move_to( UP )
        with self.voiceover(text=r"""Un cero en negrita denota un vector cuyas componentes son todas
        nulas.""") as tracker:
            self.add(Vnulo)
            self.play(Indicate(Vnulo))
            self.wait(tracker.duration/2)
            self.play(FadeOut(Vnulo))
	
        Vnulo1 = MathTex(r"\Vect{0}=", nc.V0(1).latex(), ",",  tex_template = myTemplate,)
        Vnulo2 = MathTex(r"\Vect{0}=", nc.V0(2).latex(), ",",  tex_template = myTemplate,)
        Vnulo3 = MathTex(r"\Vect{0}=", nc.V0(3).latex(), ",",  tex_template = myTemplate,)
        Vnulo6 = MathTex(r"\Vect{0}=", nc.V0(6).latex(), ",",  tex_template = myTemplate,)
        VnuloN = MathTex(r"\Vect{0}\in\R[100]",             tex_template = myTemplate,)
        grp2   = VGroup(Vnulo1,Vnulo2,Vnulo3,Vnulo6,VnuloN).arrange(RIGHT, buff=0.7)
        with self.voiceover( text = r"""Fíjese que un cero en negrita no indica su número de
        componentes. Normalmente la cantidad de ceros se deduce del contexto.""" ) as tracker:
            self.add(grp2)
            self.wait(tracker.duration)
            self.play(FadeOut(grp2),FadeOut(Notac),FadeOut(definicion))
            self.wait(1.5)

#+END_SRC

#+call: rodando(fichero="L01_V01_Vectores", escena="2")
#+call: rodandoHD(fichero="L01_V01_Vectores", escena="2")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E02_VectoresNotacion.mp4


