L01-V01-Vectores.html
<div id="outline-container-org24b2fc0" class="outline-3">
<h3 id="org24b2fc0"><span class="section-number-3">1.2.</span> Escena 2 - Notación vectores de \R[n]</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python" id="orgfa77698"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V01_E02_VectoresNotacion</span>(VoiceoverScene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )
      
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"\usepackage{nacal}"</span>)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copyright lateral</span>
        &lt;&lt;copyrightLateral&gt;&gt;
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Definici&#243;n de vector</span>
        <span style="color: #BA36A5;">definicion</span> = Tex(<span style="color: #008000;">"Un vector de "</span>,
                         r<span style="color: #008000;">"$\R[n]$"</span>,
                         r<span style="color: #008000;">" es una \emph{lista ordenada} de $n$ n&#250;meros"</span>,
                         tex_template = myTemplate,
                         ).to_edge(UP).set_width(13)
        <span style="color: #0000FF;">self</span>.add(definicion)
        <span style="color: #BA36A5;">d</span> = nc.Vector([1,2,3],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">p</span> = nc.Vector([sp.pi,sp.pi,sp.pi,sp.pi],<span style="color: #008000;">'h'</span>)
            
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Notacion</span>
        <span style="color: #BA36A5;">Notac</span> = Tex(r<span style="color: #008000;">"\textbf{Notaci&#243;n:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(BLUE).next_to(definicion, DOWN, aligned_edge=LEFT)
        <span style="color: #0000FF;">self</span>.add(Notac)
        <span style="color: #0000FF;">self</span>.wait()

        <span style="color: #BA36A5;">a</span>    = nc.Vector( [5, 1, 10] , <span style="color: #008000;">'h'</span>)        
        <span style="color: #BA36A5;">Not1</span> = MathTex(a.latex(),        tex_template = myTemplate,)
        <span style="color: #BA36A5;">Not2</span> = MathTex(r<span style="color: #008000;">"="</span>,             tex_template = myTemplate,)
        <span style="color: #BA36A5;">Not3</span> = MathTex(a.copy().latex(), tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp1</span> = VGroup(Not1,Not2,Not3).arrange(RIGHT)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""Para expresar un vector basta indicar la lista de elementos en su</span>
<span style="color: #008000;">        correspondiente orden."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(grp1)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(definicion[2][5:18]),run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""Por este motivo podemos escribir un mismo vector tanto en</span>
<span style="color: #008000;">        horizontal como en vertical. Pero tenga en cuenta que la</span>
<span style="color: #008000;">        mayor&#237;a de manuales no respetan este convenio, y consideran,</span>
<span style="color: #008000;">        al contrario de lo que haremos nosotros, que vectores fila y</span>
<span style="color: #008000;">        vectores columna son objetos distintos."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.wait(tracker.duration+0.3)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""Siempre escribiremos la lista de n&#250;meros encerrada entre</span>
<span style="color: #008000;">        par&#233;ntesis; poniendo una coma detr&#225;s de cada elemento cuando</span>
<span style="color: #008000;">        escribamos el vector en horizontal."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(grp1[0][0][::<span style="color: #006FE0;">len</span>(grp1[0][0])-1]),
                      Indicate(grp1[2][0][0:2]), Indicate(grp1[2][0][-2:]),
                      run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Flash(grp1[0][0][2]),
                      Flash(grp1[0][0][4]), Flash(grp1[0][0][7]),
                      run_time=tracker.duration/8)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/8)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0]))
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp1))
        
        <span style="color: #BA36A5;">VectorNoNumero</span> =  MathTex(r<span style="color: #008000;">"(3)"</span>,
                                  r<span style="color: #008000;">"\ne"</span>,(3*nc.V1(1)).latex(),
                                  r<span style="color: #008000;">"\in\R[1]"</span>,
                                  tex_template = myTemplate,)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""As&#237; podremos distinguir un n&#250;mero entre par&#233;ntesis de un</span>
<span style="color: #008000;">        vector de R 1;"""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(VectorNoNumero)
            <span style="color: #0000FF;">self</span>.play(Indicate(VectorNoNumero[0]),run_time=tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(VectorNoNumero[2]),run_time=tracker.duration/3)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"""es decir, de una lista con un solo n&#250;mero."""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(VectorNoNumero[3]),
                      Flash(definicion[2][-9]),
                      run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(VectorNoNumero))
            
        <span style="color: #BA36A5;">Vectores</span> = MathTex(r<span style="color: #008000;">"\Vect{a}, \Vect{b}, \Vect{c},\ldots\Vect{x}, \Vect{y}, \Vect{z}"</span>,
                           tex_template = myTemplate,).move_to( UP )
        <span style="color: #BA36A5;">Vector1</span>  = MathTex(r<span style="color: #008000;">"\Vect{a}="</span>,a.copy().latex(),   tex_template = myTemplate,)
        <span style="color: #BA36A5;">Vector2</span>  = MathTex(r<span style="color: #008000;">"\Vect{d}="</span>,d.copy().latex(),   tex_template = myTemplate,)
        <span style="color: #BA36A5;">Vector3</span>  = MathTex(r<span style="color: #008000;">"\Vect{x}="</span>,p.copy().latex(),   tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp3</span> = VGroup(Vector1,Vector2,Vector3).arrange(RIGHT, buff=2).next_to(Vectores, DOWN)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"Para denotar vectores usaremos letras min&#250;sculas en negrita</span>
<span style="color: #008000;">        cursiva."</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(Vectores)
            <span style="color: #0000FF;">self</span>.add(grp3)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Indicate(Vectores),run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Vectores))
            <span style="color: #0000FF;">self</span>.play(Indicate(Vector1[0][0],scale_factor=2.),
                      Indicate(Vector2[0][0],scale_factor=2.),
                      Indicate(Vector3[0][0],scale_factor=2.),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp3))
            
        <span style="color: #BA36A5;">Vnulo</span> = MathTex(r<span style="color: #008000;">"\Vect{0}"</span>, tex_template = myTemplate,)<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">.move_to( UP )</span>
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=r<span style="color: #008000;">"Un cero en negrita denota un vector cuyas componentes son todas</span>
<span style="color: #008000;">        nulas."</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(Vnulo)
            <span style="color: #0000FF;">self</span>.play(Indicate(Vnulo))
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Vnulo))
        
        <span style="color: #BA36A5;">Vnulo1</span> = MathTex(r<span style="color: #008000;">"\Vect{0}="</span>, nc.V0(1).latex(), <span style="color: #008000;">","</span>,  tex_template = myTemplate,)
        <span style="color: #BA36A5;">Vnulo2</span> = MathTex(r<span style="color: #008000;">"\Vect{0}="</span>, nc.V0(2).latex(), <span style="color: #008000;">","</span>,  tex_template = myTemplate,)
        <span style="color: #BA36A5;">Vnulo3</span> = MathTex(r<span style="color: #008000;">"\Vect{0}="</span>, nc.V0(3).latex(), <span style="color: #008000;">","</span>,  tex_template = myTemplate,)
        <span style="color: #BA36A5;">Vnulo6</span> = MathTex(r<span style="color: #008000;">"\Vect{0}="</span>, nc.V0(6).latex(), <span style="color: #008000;">","</span>,  tex_template = myTemplate,)
        <span style="color: #BA36A5;">VnuloN</span> = MathTex(r<span style="color: #008000;">"\Vect{0}\in\R[100]"</span>,             tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp2</span>   = VGroup(Vnulo1,Vnulo2,Vnulo3,Vnulo6,VnuloN).arrange(RIGHT, buff=0.7)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover( text = r<span style="color: #008000;">"""F&#237;jese que un cero en negrita no indica su n&#250;mero de</span>
<span style="color: #008000;">        componentes. Normalmente la cantidad de ceros se deduce del contexto."""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(grp2)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp2),FadeOut(Notac),FadeOut(definicion))
            <span style="color: #0000FF;">self</span>.wait(1.5)

</pre>
</div>
</div>
</div>
