L01-V01-Vectores.org
** Escena 3 - Selección de elementos de un vector de \R[n]
  
#+call: rodando(fichero="L01_V01_Vectores", escena="3")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E03_VectoresElementos.mp4

#+name: L01_V01_E03_VectoresElementos
#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V01_Vectores.py
class L01_V01_E03_VectoresElementos(VoiceoverScene):
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )
        #self.set_speech_service(GTTSService(lang="es", tld="com"))
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)
        
        # Copyright lateral
        <<copyrightLateral>>
        
        # Notacion
        Notac = Tex(r"\textbf{Notación para los elementos:}",
                 tex_template = myTemplate,
                 font_size=50).set_color(BLUE).to_corner(UL)
        self.wait()
        self.add(Notac)
        self.wait()
        
        # Elementos de un vector
        v_generico  = nc.Vector(sp.symbols('a:5')[1:],'h')
        cs = MathTex(r"\Vect{a}=",
                     v_generico.latex(),
                     tex_template = myTemplate,)
        
        with self.voiceover(text = r"""Lo habitual es denotar cada elemento de un vector con la letra
        de su nombre sin negrita.""" ) as tracker:
            self.wait()
            self.play(FadeIn(cs), run_time=0.5)
            self.play( Circumscribe(cs[1][1]),
                       Circumscribe(cs[1][4]),
                       Circumscribe(cs[1][7]),
                       Circumscribe(cs[1][10]),
                       run_time=tracker.duration/2)
            
        with self.voiceover(text = r"""indicando con un subíndice su posición en la
        lista.""" ) as tracker:
            self.play( Flash(cs[1][2]),
                       Flash(cs[1][5]),
                       Flash(cs[1][8]),
                       Flash(cs[1][11]),
                       run_time=tracker.duration)
            self.play(FadeOut(cs))
            
        c = nc.Vector([sp.pi,nc.fracc(3,4),0,0.11],'h')
        vector_c = MathTex(r"\Vect{c}=",c.latex(),tex_template = myTemplate,)
        A = VGroup(*[ MathTex("c_"+str(i+1)+"=&"+sp.latex(e))  for i,e in enumerate(c.lista)
                     ]).arrange(DOWN,aligned_edge=LEFT, buff=.5)
        B = Brace(A, LEFT)
        C = VGroup(A,B)        
        Elementos_c   = VGroup(vector_c, C).arrange(RIGHT, buff=1)
        with self.voiceover(text = r"""Así, para el vector C """) as tracker:
            self.play(FadeIn(vector_c))
            self.play(GrowFromCenter(B),FadeIn(A))
            
        with self.voiceover(text = r"""con c 1 denotamos su primera componente""") as tracker:
            self.play( Indicate(vector_c[1][1]),    Indicate(A[0]) )
        with self.voiceover(text = r"""con c 2 la segunda""") as tracker:
            self.play( Indicate(vector_c[1][3:6]),  Indicate(A[1]) )
        with self.voiceover(text = r"""y del mismo modo con el resto de componentes""") as tracker:
            self.play( Indicate(vector_c[1][7],
                                run_time=tracker.duration/2),
                       Indicate(A[2],
                                run_time=tracker.duration/2) )
            self.play( Indicate(vector_c[1][9:13],
                                run_time=tracker.duration/2),
                       Indicate(A[3],
                                run_time=tracker.duration/2) )
            self.wait(0.5)
            self.play( FadeOut(vector_c), FadeOut(B), FadeOut(A) )
            self.wait(0.5)

        with self.voiceover(text = r"""El hecho de emplear dos tipos de fuentes:""" ) as tracker:
            self.add(cs)
            self.wait(tracker.duration)
            
        with self.voiceover(text = r"""con negrita los vectores y sin negrita los componentes,
        dificulta distinguirlos a primera vista""" ) as tracker:
            self.play( Indicate(cs[0][ 0],scale_factor=2.),
                       Indicate(cs[0][ 0],scale_factor=2.),
                       Indicate(cs[1][ 1],scale_factor=2.),
                       Indicate(cs[1][ 4],scale_factor=2.),
                       Indicate(cs[1][ 7],scale_factor=2.),
                       Indicate(cs[1][10],scale_factor=2.), run_time=tracker.duration*2/3)

        MTa = MathTex(r"\eleVR{a}{i}",tex_template = myTemplate).scale(3)
        MTb = MathTex(r"{a}_{i}=",tex_template = myTemplate).scale(3).next_to(MTa, LEFT)
        VG  = VGroup(MTb,MTa) 
        with self.voiceover(text = r"""Es más clara y operativa una notación que use un único tipo de
        fuente, y que denote la selección de elementos con un operador. Por ejemplo con una barra
        vertical.""" ) as tracker:
            self.play(cs.animate.to_corner(DL),
                      run_time=tracker.duration*4/5)
            self.play(Indicate(VG[1][0][1]))
            self.wait(0.5)

        def VectorGenerico(s,n):
            elem = lambda s,i: sp.Symbol(r'\eleVR{'+ s +'}{'+ str(i) + '}')
            return nc.Vector([elem(s,i) for i in range(1,n+1)], 'h')
        
        v_generico2 = VectorGenerico('a',4)
        cs2 = MathTex(r"=",
                     v_generico2.latex(),
                     tex_template = myTemplate,).next_to(cs, RIGHT)
        
        VGB = VGroup(*[MathTex(sp.latex(e) + "=\; & \eleVR{a}{" + str(i) + "}",
                               tex_template = myTemplate)
                       for i,e in enumerate(v_generico.lista,1)
                       ]).scale(3)
        
        with self.voiceover( text = r"""Por ello, para denotar una componente, escribiremos un
        subíndice con una barra que medie entre el vector y el índice de la
        componente""" ) as tracker:
            self.add(VG[1])
            self.wait(tracker.duration/3)
            self.play(Indicate(VG[1][0][1:], run_time=tracker.duration/4))
            #self.wait(tracker.duration/3)
            self.play(Indicate(VG[1][0][-1], run_time=tracker.duration/4))
            self.play(Write(VG[0]))
            self.play(VG.animate.move_to([0,0,0]), run_time=tracker.duration/6)
            
            source0 = VG[0][0]
            source1 = VG[1][0]
            target  = VGB[0][0]

            transform_index0 = [[0,1,2], [0,1,2]]
            transform_index1 = [[0,1,2], [3,4,5]]
            
            self.play(
                ,*[
                    ReplacementTransform(source0[i],target[j], rate_func=rate_functions.smooth)
                    for i,j in zip(*transform_index0)
                ],
                ,*[
                    ReplacementTransform(source1[i],target[j], rate_func=rate_functions.smooth)
                    for i,j in zip(*transform_index1)
                ],
                run_time=tracker.duration/5)
            
            self.play(FadeIn(cs2) )
            self.play(FadeTransform(VGB[0][0][0:2],cs[1][ 1: 3]),
                      FadeTransform(VGB[0][0][3:],cs2[1][ 1: 4]),
                      run_time=.7)
            self.play(FadeIn(VGB[1]), FadeOut(VGB[0][0][2]))
            self.play(FadeTransform(VGB[1][0][0:2],cs[1] [4: 6]),
                      FadeTransform(VGB[1][0][3:],cs2[1][ 5: 8]),
                      FadeOut(VGB[1][0][2]),
                      run_time=.6)
            self.play(FadeIn(VGB[2]))
            self.play(FadeTransform(VGB[2][0][0:2],cs[1][ 7: 9]),
                      FadeTransform(VGB[2][0][3:],cs2[1][9:12]),
                      FadeOut(VGB[2][0][2]),
                      run_time=.5)
            self.play(FadeIn(VGB[3]))
            self.play(FadeTransform(VGB[3][0][0:2],cs[1][10:12]),
                      FadeTransform(VGB[3][0][3:],cs2[1][13:16]),
                      FadeOut(VGB[3][0][2]),
                      run_time=.4)
            self.play(FadeOut(Notac),FadeOut(cs),FadeOut(cs2))
            
        MTLR = MathTex(r"\eleVR{a}{i}",r"\;=\eleVL{a}{i}",tex_template = myTemplate).scale(3)
        with self.voiceover( text = r"""Además, admitiremos que el operador selector actúe tanto por
        la derecha como por la izquierda.""" ) as tracker:   
            self.play(FadeIn(MTLR[0]), run_time=tracker.duration/2)
            self.play(FadeIn(MTLR[1]))
            self.wait(tracker.duration/3+0.5)
            self.play(FadeOut(MTLR))
            self.wait()
            
#+END_SRC


#+call: rodando(fichero="L01_V01_Vectores", escena="3")
#+call: rodandoHD(fichero="L01_V01_Vectores", escena="3")

# file:./lib/media/videos/L01_V01_Vectores/480p15/L01_V01_E03_VectoresElementos.mp4


