L01-V01-Vectores.html
<div id="outline-container-org7cd3e79" class="outline-3">
<h3 id="org7cd3e79"><span class="section-number-3">1.3.</span> Escena 3 - Selección de elementos de un vector de \R[n]</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python" id="orgb6d9eae"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V01_E03_VectoresElementos</span>(VoiceoverScene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )
      
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))</span>
        
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"\usepackage{nacal}"</span>)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copyright lateral</span>
        &lt;&lt;copyrightLateral&gt;&gt;
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Notacion</span>
        <span style="color: #BA36A5;">Notac</span> = Tex(r<span style="color: #008000;">"\textbf{Notaci&#243;n para los elementos:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(BLUE).to_corner(UL)
        <span style="color: #0000FF;">self</span>.wait()
        <span style="color: #0000FF;">self</span>.add(Notac)
        <span style="color: #0000FF;">self</span>.wait()
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Elementos de un vector</span>
        <span style="color: #BA36A5;">v_generico</span>  = nc.Vector(sp.symbols(<span style="color: #008000;">'a:5'</span>)[1:],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">cs</span> = MathTex(r<span style="color: #008000;">"\Vect{a}="</span>,
                     v_generico.latex(),
                     tex_template = myTemplate,)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""Lo habitual es denotar cada elemento de un vector con la letra</span>
<span style="color: #008000;">        de su nombre sin negrita."""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.wait()
            <span style="color: #0000FF;">self</span>.play(FadeIn(cs), run_time=0.5)
            <span style="color: #0000FF;">self</span>.play( Circumscribe(cs[1][1]),
                       Circumscribe(cs[1][4]),
                       Circumscribe(cs[1][7]),
                       Circumscribe(cs[1][10]),
                       run_time=tracker.duration/2)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""indicando con un sub&#237;ndice su posici&#243;n en la</span>
<span style="color: #008000;">        lista."""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( Flash(cs[1][2]),
                       Flash(cs[1][5]),
                       Flash(cs[1][8]),
                       Flash(cs[1][11]),
                       run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(cs))
            
        <span style="color: #BA36A5;">c</span> = nc.Vector([sp.pi,nc.fracc(3,4),0,0.11],<span style="color: #008000;">'h'</span>)
        <span style="color: #BA36A5;">vector_c</span> = MathTex(r<span style="color: #008000;">"\Vect{c}="</span>,c.latex(),tex_template = myTemplate,)
        <span style="color: #BA36A5;">A</span> = VGroup(*[ MathTex(<span style="color: #008000;">"c_"</span>+<span style="color: #006FE0;">str</span>(i+1)+<span style="color: #008000;">"=&amp;"</span>+sp.latex(e))  <span style="color: #0000FF;">for</span> i,e <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(c.lista)
                     ]).arrange(DOWN,aligned_edge=LEFT, buff=.5)
        <span style="color: #BA36A5;">B</span> = Brace(A, LEFT)
        <span style="color: #BA36A5;">C</span> = VGroup(A,B)        
        <span style="color: #BA36A5;">Elementos_c</span>   = VGroup(vector_c, C).arrange(RIGHT, buff=1)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""As&#237;, para el vector C """</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(vector_c))
            <span style="color: #0000FF;">self</span>.play(GrowFromCenter(B),FadeIn(A))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""con c 1 denotamos su primera componente"""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( Indicate(vector_c[1][1]),    Indicate(A[0]) )
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""con c 2 la segunda"""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( Indicate(vector_c[1][3:6]),  Indicate(A[1]) )
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""y del mismo modo con el resto de componentes"""</span>) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( Indicate(vector_c[1][7],
                                run_time=tracker.duration/2),
                       Indicate(A[2],
                                run_time=tracker.duration/2) )
            <span style="color: #0000FF;">self</span>.play( Indicate(vector_c[1][9:13],
                                run_time=tracker.duration/2),
                       Indicate(A[3],
                                run_time=tracker.duration/2) )
            <span style="color: #0000FF;">self</span>.wait(0.5)
            <span style="color: #0000FF;">self</span>.play( FadeOut(vector_c), FadeOut(B), FadeOut(A) )
            <span style="color: #0000FF;">self</span>.wait(0.5)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""El hecho de emplear dos tipos de fuentes:"""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(cs)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""con negrita los vectores y sin negrita los componentes,</span>
<span style="color: #008000;">        dificulta distinguirlos a primera vista"""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( Indicate(cs[0][ 0],scale_factor=2.),
                       Indicate(cs[0][ 0],scale_factor=2.),
                       Indicate(cs[1][ 1],scale_factor=2.),
                       Indicate(cs[1][ 4],scale_factor=2.),
                       Indicate(cs[1][ 7],scale_factor=2.),
                       Indicate(cs[1][10],scale_factor=2.), run_time=tracker.duration*2/3)

        <span style="color: #BA36A5;">MTa</span> = MathTex(r<span style="color: #008000;">"\eleVR{a}{i}"</span>,tex_template = myTemplate).scale(3)
        <span style="color: #BA36A5;">MTb</span> = MathTex(r<span style="color: #008000;">"{a}_{i}="</span>,tex_template = myTemplate).scale(3).next_to(MTa, LEFT)
        <span style="color: #BA36A5;">VG</span>  = VGroup(MTb,MTa) 
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text = r<span style="color: #008000;">"""Es m&#225;s clara y operativa una notaci&#243;n que use un &#250;nico tipo de</span>
<span style="color: #008000;">        fuente, y que denote la selecci&#243;n de elementos con un operador. Por ejemplo con una barra</span>
<span style="color: #008000;">        vertical."""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(cs.animate.to_corner(DL),
                      run_time=tracker.duration*4/5)
            <span style="color: #0000FF;">self</span>.play(Indicate(VG[1][0][1]))
            <span style="color: #0000FF;">self</span>.wait(0.5)

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">VectorGenerico</span>(s,n):
            <span style="color: #BA36A5;">elem</span> = <span style="color: #0000FF;">lambda</span> s,i: sp.Symbol(r<span style="color: #008000;">'\eleVR{'</span>+ s +<span style="color: #008000;">'}{'</span>+ <span style="color: #006FE0;">str</span>(i) + <span style="color: #008000;">'}'</span>)
            <span style="color: #0000FF;">return</span> nc.Vector([elem(s,i) <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(1,n+1)], <span style="color: #008000;">'h'</span>)
        
        <span style="color: #BA36A5;">v_generico2</span> = VectorGenerico(<span style="color: #008000;">'a'</span>,4)
        <span style="color: #BA36A5;">cs2</span> = MathTex(r<span style="color: #008000;">"="</span>,
                     v_generico2.latex(),
                     tex_template = myTemplate,).next_to(cs, RIGHT)
        
        <span style="color: #BA36A5;">VGB</span> = VGroup(*[MathTex(sp.latex(e) + <span style="color: #008000;">"=\; &amp; \eleVR{a}{"</span> + <span style="color: #006FE0;">str</span>(i+1) + <span style="color: #008000;">"}"</span>,
                               tex_template = myTemplate)
                       <span style="color: #0000FF;">for</span> i,e <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(v_generico.lista)
                       ]).scale(3)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover( text = r<span style="color: #008000;">"""Por ello, para denotar una componente, escribiremos un</span>
<span style="color: #008000;">        sub&#237;ndice con una barra que medie entre el vector y el &#237;ndice de la</span>
<span style="color: #008000;">        componente"""</span> ) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(VG[1]))
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(VG[1][0][1:], run_time=tracker.duration/4))
            <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.wait(tracker.duration/3)</span>
            <span style="color: #0000FF;">self</span>.play(Indicate(VG[1][0][-1], run_time=tracker.duration/5))
            <span style="color: #0000FF;">self</span>.play(Write(VG[0]))
            <span style="color: #0000FF;">self</span>.wait()
            <span style="color: #0000FF;">self</span>.play(VG.animate.move_to([0,0,0]))
            <span style="color: #0000FF;">self</span>.play(Transform(VG[1][0][-1],VGB[0][0][-1]),
                      Transform(VG[0][0][:2],VGB[0][0][:2]),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play( FadeIn(cs2) )
            <span style="color: #0000FF;">self</span>.play(FadeTransform(VGB[0][0][0:2],cs[1][ 1: 3]),
                      FadeTransform(VGB[0][0][3:],cs2[1][ 1: 6]),
                      FadeOut(VG),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play(FadeIn(VGB[1]), FadeOut(VGB[0][0][2]))
            <span style="color: #0000FF;">self</span>.play(FadeTransform(VGB[1][0][0:2],cs[1] [4: 6]),
                      FadeTransform(VGB[1][0][3:],cs2[1][ 7:12]),
                      FadeOut(VGB[1][0][2]),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play(FadeIn(VGB[2]))
            <span style="color: #0000FF;">self</span>.play(FadeTransform(VGB[2][0][0:2],cs[1][ 7: 9]),
                      FadeTransform(VGB[2][0][3:],cs2[1][13:18]),
                      FadeOut(VGB[2][0][2]),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play(FadeIn(VGB[3]))
            <span style="color: #0000FF;">self</span>.play(FadeTransform(VGB[3][0][0:2],cs[1][10:12]),
                      FadeTransform(VGB[3][0][3:],cs2[1][19:24]),
                      FadeOut(VGB[3][0][2]),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(Notac),FadeOut(cs),FadeOut(cs2))
            
        <span style="color: #BA36A5;">MTLR</span> = MathTex(r<span style="color: #008000;">"\eleVR{a}{i}"</span>,r<span style="color: #008000;">"\;=\eleVL{a}{i}"</span>,tex_template = myTemplate).scale(3)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover( text = r<span style="color: #008000;">"""Adem&#225;s, admitiremos que el operador selector act&#250;e tanto por</span>
<span style="color: #008000;">        la derecha como por la izquierda."""</span> ) <span style="color: #0000FF;">as</span> tracker:   
            <span style="color: #0000FF;">self</span>.play(FadeIn(MTLR[0]), run_time=2*tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(FadeIn(MTLR[1]))
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/3+0.5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(MTLR))
            <span style="color: #0000FF;">self</span>.wait()
            
</pre>
</div>
</div>
</div>
</div>
