L01-V01-Vectores.org
**** COMMENT En baja resolución                                   :noexports:

#+call: rodando(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+call: montando(video="L01_V01_Vectores")

#+call: fade(video="L01_V01_Vectores")

**** COMMENT En alta resolución                                   :noexports:

#+call: rodandoHD(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+call: montandoHD(video="L01_V01_Vectores")

#+call: fade(video="L01_V01_Vectores")

# file:./L01_V01_Vectores.mp4


*** COMMENT Versión en inglés

#+BEGIN_SRC sh :dir lib :var fichero="L01_V01_Vectores" :var escena="L01_V01_VectoresDefinicion"
manim_render_translation $fichero.py -s $escena -d $escenaENG -l en -ql
#+END_SRC

# manim_render_translation L01_V01_Vectores.py -s L01_V01_VectoresDefinicion -d L01_V01_VectoresDefinicionENG -l en -ql

# 
   

* Trozos comunes de código


** Carga de la librería Manim y NacAL

#+name: Carga de la librería Manim y NacAL
#+BEGIN_SRC python
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.gtts import GTTSService
import nacal as nc
import sympy as sp

# PARA LA TRADUCCIÓN (pero no me ha funcionado)

#from manim_voiceover.translate import get_gettext
# # It is good practice to get the LOCALE and DOMAIN from environment variables
#import os
#LOCALE = os.getenv("LOCALE")
#DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
#_ = get_gettext()
#+END_SRC

#+name: Carga de la librería Manim y NacAL con AzureService
#+BEGIN_SRC python
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.azure import AzureService
import nacal as nc
import sympy as sp

# PARA LA TRADUCCIÓN (pero no me ha funcionado)

#from manim_voiceover.translate import get_gettext
# # It is good practice to get the LOCALE and DOMAIN from environment variables
#import os
#LOCALE = os.getenv("LOCALE")
#DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
#_ = get_gettext()
#+END_SRC


** Creditos

#+name: copyrightLateral
#+BEGIN_SRC python
copyright = Tex(r"\textcopyright{\;} 2024\; Marcos Bujosa  ")
CGG  = VGroup(copyright).rotate(PI/2).scale(0.5).to_edge(RIGHT, buff=0.1).set_color(GRAY_D)
self.add(CGG)
#+END_SRC


#+name: copyright
#+BEGIN_SRC python :noweb tangle
class ZCreditos(Scene):
    def construct(self):
        copyright = Tex(r"\textcopyright{\;} 2024 \; Marcos Bujosa")
        github = Tex(r"\texttt{https://github.com/mbujosab}").next_to(copyright, DOWN)
        CGG  = VGroup(copyright,github).scale(1.1)
        self.add(CGG)
        self.wait(10)
#+END_SRC

#+call: rodando(fichero="L01_V01_Vectores", escena="4")

#+call: rodandoHD(fichero="L01_V01_Vectores", escena="4")

#+call: montandoHD(video="L01_V01_Vectores")

#+call: fade(video="L01_V01_Vectores")

*** COMMENT Código obtener subíndices de caracteres en expresiones

Este código indexa los elementos de expresiones en \LaTeX para
facilitar la transformación de una expresión en otra mediante la
transformación de unos elementos en otros.

#+name: Obtención de subíndices de caracteres en expresiones
#+BEGIN_SRC python  :results discard

import itertools
def get_sub_indexes(tex):
    ni = VGroup()
    colors = itertools.cycle([RED,TEAL,GREEN,BLUE,PURPLE])
    for i in range(len(tex)):
        n = Text(f"{i}",color=next(colors)).scale(0.7)
        n.next_to(tex[i],DOWN,buff=0.01)
        ni.add(n)
    return ni

#+END_SRC




* Rodando: 1,2,3\dots ¡acción!


#+call: rodando(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+call: montando(video="L01_V01_Vectores")

#+call: fade(video="L01_V01_Vectores")


#+call: rodandoHD(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+call: montandoHD(video="L01_V01_Vectores")

#+call: fade(video="L01_V01_Vectores")


**** Generamos un fichero ~mpeg~ por cada escena

# Versión de poca calidad

#+call: rodando(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+name: rodando
#+BEGIN_SRC bash :var fichero="L01_V01_Vectores" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -pql $fichero.py --disable_caching
#+END_SRC

# Versión calidad HD1080

#+call: rodandoHD(fichero="L01_V01_Vectores", escena="1,2,3,4")

#+name: rodandoHD
#+BEGIN_SRC bash :var fichero="L01_V01_Vectores" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -qh $fichero.py --disable_caching
#+END_SRC

