L01-V01-Vectores.html
<div id="outline-container-orgca16ea7" class="outline-2">
<h2 id="orgca16ea7"><span class="section-number-2">2.</span> Trozos comunes de código</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6777b50" class="outline-3">
<h3 id="org6777b50"><span class="section-number-3">2.1.</span> Carga de la librería Manim y NacAL</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python" id="org4ae03ec"><span style="color: #0000FF;">from</span> manim <span style="color: #0000FF;">import</span> *
<span style="color: #0000FF;">from</span> manim_voiceover <span style="color: #0000FF;">import</span> VoiceoverScene
<span style="color: #0000FF;">from</span> manim_voiceover.services.gtts <span style="color: #0000FF;">import</span> GTTSService
<span style="color: #0000FF;">import</span> nacal <span style="color: #0000FF;">as</span> nc
<span style="color: #0000FF;">import</span> sympy <span style="color: #0000FF;">as</span> sp

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">PARA LA TRADUCCI&#211;N (pero no me ha funcionado)</span>

<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">from manim_voiceover.translate import get_gettext</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;"># It is good practice to get the LOCALE and DOMAIN from environment variables</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">import os</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">LOCALE = os.getenv("LOCALE")</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">DOMAIN = os.getenv("DOMAIN")</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">The following function uses LOCALE and DOMAIN to set the language, and</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">returns a gettext function that is used to insert translations.</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">_ = get_gettext()</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="org8b1e872"><span style="color: #0000FF;">from</span> manim <span style="color: #0000FF;">import</span> *
<span style="color: #0000FF;">from</span> manim_voiceover <span style="color: #0000FF;">import</span> VoiceoverScene
<span style="color: #0000FF;">from</span> manim_voiceover.services.azure <span style="color: #0000FF;">import</span> AzureService
<span style="color: #0000FF;">import</span> nacal <span style="color: #0000FF;">as</span> nc
<span style="color: #0000FF;">import</span> sympy <span style="color: #0000FF;">as</span> sp

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">PARA LA TRADUCCI&#211;N (pero no me ha funcionado)</span>

<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">from manim_voiceover.translate import get_gettext</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;"># It is good practice to get the LOCALE and DOMAIN from environment variables</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">import os</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">LOCALE = os.getenv("LOCALE")</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">DOMAIN = os.getenv("DOMAIN")</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">The following function uses LOCALE and DOMAIN to set the language, and</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">returns a gettext function that is used to insert translations.</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">_ = get_gettext()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdedccf" class="outline-3">
<h3 id="orgcdedccf"><span class="section-number-3">2.2.</span> Creditos</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python" id="org302b05c"><span style="color: #D0372D;">copyright</span> = Tex(r<span style="color: #008000;">"\textcopyright{\;} 2024\; Marcos Bujosa  "</span>)
<span style="color: #BA36A5;">CGG</span>  = VGroup(<span style="color: #D0372D;">copyright</span>).rotate(PI/2).scale(0.5).to_edge(RIGHT, buff=0.1).set_color(GRAY_D)
<span style="color: #0000FF;">self</span>.add(CGG)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python" id="org99832f8"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ZCreditos</span>(Scene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #D0372D;">copyright</span> = Tex(r<span style="color: #008000;">"\textcopyright{\;} 2024 \; Marcos Bujosa"</span>)
        <span style="color: #BA36A5;">github</span> = Tex(r<span style="color: #008000;">"\texttt{https://github.com/mbujosab}"</span>).next_to(<span style="color: #D0372D;">copyright</span>, DOWN)
        <span style="color: #BA36A5;">CGG</span>  = VGroup(<span style="color: #D0372D;">copyright</span>,github).scale(1.1)
        <span style="color: #0000FF;">self</span>.add(CGG)
        <span style="color: #0000FF;">self</span>.wait(10)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a9ce80" class="outline-2">
<h2 id="org3a9ce80"><span class="section-number-2">3.</span> Rodando: 1,2,3&hellip; ¡acción!</h2>
<div class="outline-text-2" id="text-3">
</div>
<ol class="org-ol">
<li><a id="org4744aa5"></a>Generamos un fichero <code>mpeg</code> por cada escena<br />
<div class="outline-text-5" id="text-3-0-0-1">
<div class="org-src-container">
<pre class="src src-bash" id="org038f8ee"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -pql $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash" id="org8f08783"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -qh $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>
</div>
</li>
