L01-V01-Vectores.org
**** Concatenamos las escenas en un único fichero ~mpeg~ y añadimos música de fondo.
     
- Montando la versión de baja resolución

#+call: montando(video="L01_V01_Vectores")

#+name: montando
#+BEGIN_SRC bash  :var subdir="lib/media/videos" :var video="L01_V01_Vectores" :var calidad="480p15"  :var music="music/3Blue1Brown-Zeta" :results silent
rm -f $subdir/$video/$calidad/$video.mp4 list.txt
for f in $subdir/$video/$calidad/*.mp4 ; do echo file \'$f\' >> list.txt; done && ffmpeg -f concat -safe 0 -i list.txt -c copy $subdir/$video/$calidad/$video.mp4

mkdir -p tmp

ffmpeg -i $subdir/$video/$calidad/$video.mp4 -i $music.mp3 -filter_complex "[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]" -c:v libx264 -c:a aac -map 0:v -map "[out]" -preset ultrafast -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$video.mp4
#+END_SRC

 1) La primera parte de este script concatena todos los archivos de
    video ~.mp4~ encontrados en una carpeta específica en un solo
    archivo de video. Lo hace en dos pasos:

  + *Genera un archivo de lista de archivos (~list.txt~):*

    - Utiliza un bucle ~for~ para iterar sobre todos los archivos con
      extensión ~.mp4~ en la carpeta especificada por la variable
      ~$subdir/$video/$calidad/~.
    
    - Por cada archivo encontrado, agrega una línea al archivo
      ~list.txt~ que contiene la ruta completa del archivo.
    
    - Utiliza el operador =>= =>= para redirigir la salida al final del
      archivo ~list.txt~.
       
  + *Utiliza ffmpeg para concatenar los archivos de video listados en ~list.txt~:*
    - Utiliza ~ffmpeg~ con la opción ~-f concat~ para indicar que se
      está utilizando un archivo de lista para concatenar.
    - ~-safe 0~ se usa para permitir la lectura de archivos de
      cualquier ruta.
    - ~-i list.txt~ especifica el archivo de lista generado
      anteriormente como entrada.
    - ~-c copy~ indica a ~ffmpeg~ que simplemente copie los flujos de
      audio y video de entrada sin realizar ninguna conversión.
    - Finalmente, el resultado se guarda en un nuevo archivo de video
      con el mismo nombre que la variable ~$video~, pero con la
      extensión ~.mp4~, en la carpeta especificada por
      ~$subdir/$video/$calidad/~.
  
 2) En la segunda parte el comando de `ffmpeg` realiza varias acciones
    para procesar un video junto con un archivo de audio y generar un
    nuevo archivo de video:

  a. *Entradas de archivos de video y audio:*
     - ~-i $subdir/$video/$calidad/$video.mp4~: Especifica el archivo
       de video de entrada.
     - ~-i $music.mp3~: Especifica el archivo de audio de entrada que
       se usará como música de fondo.
  
  b. *Filtro de complejidad (~-filter_complex~):*
     - ~[0:a]apad[main]~: Añade un silencio al audio del video de
       entrada (~[0:a]~) y lo asigna a la etiqueta ~[main]~.
     - ~[1:a]volume=0.04,apad[A]~: Ajusta el volumen del audio de
       entrada (~[1:a]~) al 4% del volumen original, añade un silencio
       y lo asigna a la etiqueta ~[A]~.
     - ~[main][A]amerge[out]~: Fusiona los flujos de audio etiquetados
       como ~[main]~ y ~[A]~ en un solo flujo de audio, asignado a la
       etiqueta ~[out]~.
  
  c. *Configuración de códecs y opciones de salida:*
     - ~-c:v libx264~: Utiliza el códec de video H.264 para codificar
       el video de salida.
     - ~-c:a aac~: Utiliza el códec de audio AAC para codificar el
       audio de salida.
     - ~-map 0:v -map "[out]"~: Mapea el flujo de video del archivo de
       video de entrada y el flujo de audio resultante del filtro
       complejo.
     - ~-preset ultrafast~: Establece el preset de codificación en
       "ultrafast" para una codificación más rápida.
     - ~-threads 0~: Utiliza el número máximo de hilos disponibles
       para la codificación.
     - ~-profile:v baseline~: Especifica el perfil de codificación de
       video como "baseline".
     - ~-ac 2~: Establece el número de canales de audio a 2 (estéreo).
     - ~-pix_fmt yuv420p~: Especifica el formato de píxeles del video
       de salida como yuv420p.
     - ~-shortest~: Hace que la duración del video de salida sea igual
       a la duración del archivo de video de entrada más corto o la
       duración del audio de entrada más corto.
     - ~-y tmp/$video.mp4~: Especifica el nombre del archivo de video
       de salida y la ruta donde se guardará.

  En resumen, este comando de ~ffmpeg~ combina un video con un archivo
  de audio de fondo, ajustando el volumen del audio de fondo y
  fusionando los flujos de audio para crear un nuevo archivo de video
  con las especificaciones dadas.


- Montando la versión de resolución HD1080

#+BEGIN_SRC 
ffmpeg -i L01_V01_Vectores.mp4 voz.mp3
ffmpeg -y -i 3Blue1Brown-Zeta-X2.mp3 -i voz.mp3 -filter_complex "[0:a]volume=.15[A];[1:a][A]amerge[out]" -map [out] -c:a libmp3lame -q:a 4 voz_y_musica.mp3
ffmpeg -i L01_V01_Vectores.mp4 -an videomudo.mp4
ffmpeg  -i videomudo.mp4 -i voz_y_musica.mp3 -shortest final.mp4
#+END_SRC

#+BEGIN_SRC sh
ffmpeg -y -i $subdir/$video/$calidad/$video.mp4 tmp/voz.mp3
ffmpeg -y -i $music.mp3 -i tmp/voz.mp3 -filter_complex "[0:a]volume=.15[A];[1:a][A]amerge[out]" -map [out] -c:a libmp3lame -q:a 4 tmp/voz_y_musica.mp3
ffmpeg -y -i $subdir/$video/$calidad/$video.mp4 -an tmp/videomudo.mp4
ffmpeg -y -i tmp/videomudo.mp4 -i tmp/voz_y_musica.mp3 -shortest tmp/$video.mp4
#+END_SRC


#+call: montandoHD(video="L01_V01_Vectores")

#+name: montandoHD
#+BEGIN_SRC sh  :var subdir="lib/media/videos" :var video="L01_V01_Vectores" :var calidad="1080p60" :var music="music/3Blue1Brown-Zeta-X2" :results silent
rm -f $subdir/$video/$calidad/$video.mp4 list.txt
for f in $subdir/$video/$calidad/*.mp4 ; do echo file \'$f\' >> list.txt; done && ffmpeg -f concat -safe 0 -i list.txt -c copy $subdir/$video/$calidad/$video.mp4

mkdir -p tmp

ffmpeg -i $subdir/$video/$calidad/$video.mp4 -i $music.mp3 -filter_complex "[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]" -c:v libx264 -c:a aac -map 0:v -map "[out]" -preset medium -tune stillimage -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$video.mp4
#+END_SRC


