L01-V01-Vectores.html
<li><a id="orge5e5c55"></a>Concatenamos las escenas en un único fichero <code>mpeg</code> y añadimos música de fondo.<br />
<div class="outline-text-5" id="text-3-0-0-2">
<ul class="org-ul">
<li>Montando la versión de baja resolución</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org0d309c5">rm -f $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 list.txt
<span style="color: #0000FF;">for</span> f<span style="color: #0000FF;"> in</span> $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/*.mp4 ; <span style="color: #0000FF;">do </span><span style="color: #006FE0;">echo</span> file <span style="color: #008000;">\'</span>$<span style="color: #BA36A5;">f</span><span style="color: #008000;">\'</span> &gt;&gt; list.txt; <span style="color: #0000FF;">done</span> &amp;&amp; ffmpeg -f concat -safe 0 -i list.txt -c copy $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4

mkdir -p tmp

ffmpeg -i $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 -i $<span style="color: #BA36A5;">music</span>.mp3 -filter_complex <span style="color: #008000;">"[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]"</span> -c:v libx264 -c:a aac -map 0:v -map <span style="color: #008000;">"[out]"</span> -preset ultrafast -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>

<ol class="org-ol">
<li>La primera parte de este script concatena todos los archivos de
video <code>.mp4</code> encontrados en una carpeta específica en un solo
archivo de video. Lo hace en dos pasos:

<ul class="org-ul">
<li><b>Genera un archivo de lista de archivos (<code>list.txt</code>):</b>

<ul class="org-ul">
<li>Utiliza un bucle <code>for</code> para iterar sobre todos los archivos con
extensión <code>.mp4</code> en la carpeta especificada por la variable
<code>$subdir/$video/$calidad/</code>.</li>

<li>Por cada archivo encontrado, agrega una línea al archivo
<code>list.txt</code> que contiene la ruta completa del archivo.</li>

<li>Utiliza el operador <code>&gt;</code> <code>&gt;</code> para redirigir la salida al final del
archivo <code>list.txt</code>.</li>
</ul></li>

<li><b>Utiliza ffmpeg para concatenar los archivos de video listados en <code>list.txt</code>:</b>
<ul class="org-ul">
<li>Utiliza <code>ffmpeg</code> con la opción <code>-f concat</code> para indicar que se
está utilizando un archivo de lista para concatenar.</li>
<li><code>-safe 0</code> se usa para permitir la lectura de archivos de
cualquier ruta.</li>
<li><code>-i list.txt</code> especifica el archivo de lista generado
anteriormente como entrada.</li>
<li><code>-c copy</code> indica a <code>ffmpeg</code> que simplemente copie los flujos de
audio y video de entrada sin realizar ninguna conversión.</li>
<li>Finalmente, el resultado se guarda en un nuevo archivo de video
con el mismo nombre que la variable <code>$video</code>, pero con la
extensión <code>.mp4</code>, en la carpeta especificada por
<code>$subdir/$video/$calidad/</code>.</li>
</ul></li>
</ul></li>

<li><p>
En la segunda parte el comando de `ffmpeg` realiza varias acciones
para procesar un video junto con un archivo de audio y generar un
nuevo archivo de video:
</p>

<ol class="org-ol">
<li><b>Entradas de archivos de video y audio:</b>
<ul class="org-ul">
<li><code>-i $subdir/$video/$calidad/$video.mp4</code>: Especifica el archivo
de video de entrada.</li>
<li><code>-i $music.mp3</code>: Especifica el archivo de audio de entrada que
se usará como música de fondo.</li>
</ul></li>

<li><b>Filtro de complejidad (<code>-filter_complex</code>):</b>
<ul class="org-ul">
<li><code>[0:a]apad[main]</code>: Añade un silencio al audio del video de
entrada (<code>[0:a]</code>) y lo asigna a la etiqueta <code>[main]</code>.</li>
<li><code>[1:a]volume=0.04,apad[A]</code>: Ajusta el volumen del audio de
entrada (<code>[1:a]</code>) al 4% del volumen original, añade un silencio
y lo asigna a la etiqueta <code>[A]</code>.</li>
<li><code>[main][A]amerge[out]</code>: Fusiona los flujos de audio etiquetados
como <code>[main]</code> y <code>[A]</code> en un solo flujo de audio, asignado a la
etiqueta <code>[out]</code>.</li>
</ul></li>

<li><b>Configuración de códecs y opciones de salida:</b>
<ul class="org-ul">
<li><code>-c:v libx264</code>: Utiliza el códec de video H.264 para codificar
el video de salida.</li>
<li><code>-c:a aac</code>: Utiliza el códec de audio AAC para codificar el
audio de salida.</li>
<li><code>-map 0:v -map "[out]"</code>: Mapea el flujo de video del archivo de
video de entrada y el flujo de audio resultante del filtro
complejo.</li>
<li><code>-preset ultrafast</code>: Establece el preset de codificación en
"ultrafast" para una codificación más rápida.</li>
<li><code>-threads 0</code>: Utiliza el número máximo de hilos disponibles
para la codificación.</li>
<li><code>-profile:v baseline</code>: Especifica el perfil de codificación de
video como "baseline".</li>
<li><code>-ac 2</code>: Establece el número de canales de audio a 2 (estéreo).</li>
<li><code>-pix_fmt yuv420p</code>: Especifica el formato de píxeles del video
de salida como yuv420p.</li>
<li><code>-shortest</code>: Hace que la duración del video de salida sea igual
a la duración del archivo de video de entrada más corto o la
duración del audio de entrada más corto.</li>
<li><code>-y tmp/$video.mp4</code>: Especifica el nombre del archivo de video
de salida y la ruta donde se guardará.</li>
</ul></li>
</ol>

<p>
En resumen, este comando de <code>ffmpeg</code> combina un video con un archivo
de audio de fondo, ajustando el volumen del audio de fondo y
fusionando los flujos de audio para crear un nuevo archivo de video
con las especificaciones dadas.
</p></li>
</ol>


<ul class="org-ul">
<li>Montando la versión de resolución HD1080</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org5968854">rm -f $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 list.txt
<span style="color: #0000FF;">for</span> f<span style="color: #0000FF;"> in</span> $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/*.mp4 ; <span style="color: #0000FF;">do </span><span style="color: #006FE0;">echo</span> file <span style="color: #008000;">\'</span>$<span style="color: #BA36A5;">f</span><span style="color: #008000;">\'</span> &gt;&gt; list.txt; <span style="color: #0000FF;">done</span> &amp;&amp; ffmpeg -f concat -safe 0 -i list.txt -c copy $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4

mkdir -p tmp

ffmpeg -i $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 -i $<span style="color: #BA36A5;">music</span>.mp3 -filter_complex <span style="color: #008000;">"[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]"</span> -c:v libx264 -c:a aac -map 0:v -map <span style="color: #008000;">"[out]"</span> -preset medium -tune stillimage -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>
</div>
</li>
