L01-V01-Vectores.org
**** Fundimos a negro los últimos segundos del vídeo (y la música).

#+call: fade(video="L01_V01_Vectores")

#+name: fade
#+BEGIN_SRC bash :var video="L01_V01_Vectores" :results silent
dur=$(ffprobe -loglevel error -show_entries format=duration -of default=nk=1:nw=1 "tmp/$video.mp4") && offset=$(bc -l <<< "$dur"-7) && ffmpeg -i "tmp/$video.mp4" -filter_complex "[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]" -map "[v]" -map "[a]" -y $video.mp4
#+END_SRC

Este código es un script que utiliza las herramientas ~ffprobe~ y ~ffmpeg~ para aplicar efectos de fundido a un video.Aquí está desglosado paso a paso:


1) ~dur=$(ffprobe -loglevel error -show_entries format=duration -of
   default=nk=1:nw=1 "tmp/$video.mp4")~: Este comando utiliza
   ~ffprobe~ para obtener la duración del video especificado por la
   variable ~$video~. La duración se guarda en la variable ~dur~.

2) =offset=$(bc -l \<\<\< "$dur"-7)=: Luego, se calcula un valor de
   desplazamiento (~offset~) restando 7 segundos de la duración del
   video. Esto sugiere que el objetivo es aplicar los efectos de
   fundido durante los últimos 7 segundos del video.

3) ~ffmpeg -i "tmp/$video.mp4" -filter_complex "[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]" -map "[v]" -map "[a]" -y $video.mp4~: Finalmente, se utiliza ~ffmpeg~ para aplicar los efectos de fundido. El filtro ~-filter_complex~ se utiliza para aplicar un fundido de entrada (~fade=type=in~) y un fundido de salida (~fade=type=out~) tanto al video como al audio. El fundido de entrada del audio (~afade=type=in:duration=1~) tiene una duración de 1 segundo. Los fundidos de salida de audio y video tienen una duración de 6 segundos y comienzan en el tiempo especificado por el ~offset~. El resultado se guarda en un nuevo archivo de video con el nombre ~$video.mp4~.

En resumen, este script toma un video, calcula su duración, y luego aplica efectos de fundido de entrada y salida tanto al video como al audio, comenzando 7 segundos antes del final del video.


**** Copiamos el resultado a un lugar público

#+call: publicar(video="L01_V01_Vectores")

#+name: publicar
#+BEGIN_SRC sh :var subdir="/home/marcos/CloudStation/Nextcloud/pub/Mates2Videos" :var video="L01_V01_Vectores"  :results silent
cp -f $video.mp4 $subdir/$video.mp4
#+END_SRC

