L01-V01-Vectores.html
<li><a id="org790d0d6"></a>Fundimos a negro los últimos segundos del vídeo (y la música).<br />
<div class="outline-text-5" id="text-3-0-0-3">
<div class="org-src-container">
<pre class="src src-bash" id="org1ab1863"><span style="color: #BA36A5;">dur</span>=$(<span style="color: #FF1493;">ffprobe -loglevel error -show_entries format=duration -of default=nk=1:nw=1 "tmp/$video.mp4"</span>) &amp;&amp; <span style="color: #BA36A5;">offset</span>=$(<span style="color: #FF1493;">bc -l &lt;&lt;&lt; "$dur"-7</span>) &amp;&amp; ffmpeg -i <span style="color: #008000;">"tmp/$video.mp4"</span> -filter_complex <span style="color: #008000;">"[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]"</span> -map <span style="color: #008000;">"[v]"</span> -map <span style="color: #008000;">"[a]"</span> -y $<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>

<p>
Este código es un script que utiliza las herramientas <code>ffprobe</code> y <code>ffmpeg</code> para aplicar efectos de fundido a un video.Aquí está desglosado paso a paso:
</p>


<ol class="org-ol">
<li><code>dur=$(ffprobe -loglevel error -show_entries format=duration -of
   default=nk=1:nw=1 "tmp/$video.mp4")</code>: Este comando utiliza
<code>ffprobe</code> para obtener la duración del video especificado por la
variable <code>$video</code>. La duración se guarda en la variable <code>dur</code>.</li>

<li><code>offset=$(bc -l \&lt;\&lt;\&lt; "$dur"-7)</code>: Luego, se calcula un valor de
desplazamiento (<code>offset</code>) restando 7 segundos de la duración del
video. Esto sugiere que el objetivo es aplicar los efectos de
fundido durante los últimos 7 segundos del video.</li>

<li><code>ffmpeg -i "tmp/$video.mp4" -filter_complex "[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]" -map "[v]" -map "[a]" -y $video.mp4</code>: Finalmente, se utiliza <code>ffmpeg</code> para aplicar los efectos de fundido. El filtro <code>-filter_complex</code> se utiliza para aplicar un fundido de entrada (<code>fade=type=in</code>) y un fundido de salida (<code>fade=type=out</code>) tanto al video como al audio. El fundido de entrada del audio (<code>afade=type=in:duration=1</code>) tiene una duración de 1 segundo. Los fundidos de salida de audio y video tienen una duración de 6 segundos y comienzan en el tiempo especificado por el <code>offset</code>. El resultado se guarda en un nuevo archivo de video con el nombre <code>$video.mp4</code>.</li>
</ol>

<p>
En resumen, este script toma un video, calcula su duración, y luego aplica efectos de fundido de entrada y salida tanto al video como al audio, comenzando 7 segundos antes del final del video.
</p>
</div>
</li>
<li><a id="orgdea1fb5"></a>Copiamos el resultado a un lugar público<br />
<div class="outline-text-5" id="text-3-0-0-4">
<div class="org-src-container">
<pre class="src src-sh" id="org55ff4b0">cp -f $<span style="color: #BA36A5;">video</span>.mp4 $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcos Bujosa</p>
<p class="date">Created: 2024-12-23 lun 15:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
